# RampDoesntReachOffset Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..RampDoesntReachOffset Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The ramp is not long enough to reach the top constraint plus top offset. Change the slope or increase the length of the ramp.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId RampDoesntReachOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RampDoesntReachOffset As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ RampDoesntReachOffset {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace